# Example of updating DataFrame using `loc` and `at`

In [1]:
import pandas as pd
import numpy as np

Define some dummy data that we can play with.

In [2]:
data = [
    ['Alice', 25, 'A'],
    ['Bob', 30, np.nan],
    ['Charlie', 35, 'C']
]

Create a pandas DataFrame from our dummy data so that we can try out the `loc` and `at` methods.

In [3]:
df = pd.DataFrame(data, columns=['Name', 'Age', 'Grade'])

In [4]:
df

      Name  Age Grade
0    Alice   25     A
1      Bob   30   NaN
2  Charlie   35     C

Update Bob's grade using `loc`.

In [5]:
df.loc[1, 'Grade'] = 'B'

In [6]:
df

      Name  Age Grade
0    Alice   25     A
1      Bob   30     B
2  Charlie   35     C

Update Bob's grade again using `at`.

In [7]:
df.at[1, 'Grade'] = 'B+'

In [8]:
df

      Name  Age Grade
0    Alice   25     A
1      Bob   30    B+
2  Charlie   35     C